---
kind: property
id: P:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.StructuralSectionShape
source: html/bd64b961-346b-e508-b36a-889a69af92fd.htm
---
# Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection.StructuralSectionShape Property

The type of structural section shape.

## Syntax (C#)
```csharp
public StructuralSectionShape StructuralSectionShape { get; }
```